New folder/app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends"
---
	def index
		@friend = Friend.all