app/controllers/biology_controller.rb

SELECT "biologys".* FROM "biologys" WHERE "biologys"."friend_id" = 7 LIMIT 1
---
	def show
		@biology = Biologys.find_by_friend_id(params[:id])